### Forest: Sync Check Service Infrastructure Plan: success

<details><summary>Show Plan</summary>

```
12:33:14.373 STDOUT terraform: data.external.sources_tar: Reading...
12:33:14.374 STDOUT terraform: data.digitalocean_ssh_keys.keys: Reading...
12:33:14.374 STDOUT terraform: data.digitalocean_project.forest_project: Reading...
12:33:14.374 STDOUT terraform: data.local_file.init: Reading...
12:33:14.376 STDOUT terraform: data.local_file.init: Read complete after 0s [id=8f06c32ae54175fe92d10d4176a7080693818664]
12:33:14.386 STDOUT terraform: data.external.sources_tar: Read complete after 0s [id=-]
12:33:14.390 STDOUT terraform: data.local_file.sources: Reading...
12:33:14.392 STDOUT terraform: data.local_file.sources: Read complete after 0s [id=3bec953d7b1afef459c6c0f460b79feff7371629]
12:33:14.842 STDOUT terraform: data.digitalocean_ssh_keys.keys: Read complete after 1s [id=ssh_keys/13452342636441856677]
12:33:14.846 STDOUT terraform: digitalocean_droplet.forest: Refreshing state... [id=486793518]
12:33:15.919 STDOUT terraform: data.digitalocean_project.forest_project: Read complete after 2s [id=da5e6601-7fd9-4d02-951e-390f7feb3411]
12:33:15.939 STDOUT terraform: Terraform used the selected providers to generate the following execution
12:33:15.939 STDOUT terraform: plan. Resource actions are indicated with the following symbols:
12:33:15.939 STDOUT terraform:   + create
12:33:15.939 STDOUT terraform: -/+ destroy and then create replacement
12:33:15.939 STDOUT terraform: Terraform will perform the following actions:
12:33:15.939 STDOUT terraform:   # digitalocean_droplet.forest is tainted, so must be replaced
12:33:15.939 STDOUT terraform: -/+ resource "digitalocean_droplet" "forest" {
12:33:15.939 STDOUT terraform:       ~ created_at           = "2025-04-02T10:24:55Z" -> (known after apply)
12:33:15.939 STDOUT terraform:       ~ disk                 = 200 -> (known after apply)
12:33:15.939 STDOUT terraform:       ~ id                   = "486793518" -> (known after apply)
12:33:15.939 STDOUT terraform:       ~ ipv4_address         = "167.99.128.250" -> (known after apply)
12:33:15.939 STDOUT terraform:       ~ ipv4_address_private = "10.135.0.18" -> (known after apply)
12:33:15.939 STDOUT terraform:       + ipv6_address         = (known after apply)
12:33:15.939 STDOUT terraform:       ~ locked               = false -> (known after apply)
12:33:15.939 STDOUT terraform:       ~ memory               = 16384 -> (known after apply)
12:33:15.939 STDOUT terraform:         name                 = "prod-sync-check"
12:33:15.940 STDOUT terraform:       ~ price_hourly         = 0.125 -> (known after apply)
12:33:15.940 STDOUT terraform:       ~ price_monthly        = 84 -> (known after apply)
12:33:15.940 STDOUT terraform:       ~ private_networking   = true -> (known after apply)
12:33:15.940 STDOUT terraform:       ~ status               = "active" -> (known after apply)
12:33:15.940 STDOUT terraform:         tags                 = [
12:33:15.940 STDOUT terraform:             "iac",
12:33:15.940 STDOUT terraform:             "prod",
12:33:15.940 STDOUT terraform:         ]
12:33:15.940 STDOUT terraform:       ~ urn                  = "do:droplet:486793518" -> (known after apply)
12:33:15.940 STDOUT terraform:       ~ vcpus                = 4 -> (known after apply)
12:33:15.940 STDOUT terraform:       ~ volume_ids           = [] -> (known after apply)
12:33:15.940 STDOUT terraform:       ~ vpc_uuid             = "46a525ac-fd37-47ea-bb10-95c1db0055f7" -> (known after apply)
12:33:15.940 STDOUT terraform:         # (10 unchanged attributes hidden)
12:33:15.940 STDOUT terraform:     }
12:33:15.940 STDOUT terraform:   # digitalocean_project_resources.connect_forest_project will be created
12:33:15.940 STDOUT terraform:   + resource "digitalocean_project_resources" "connect_forest_project" {
12:33:15.940 STDOUT terraform:       + id        = (known after apply)
12:33:15.940 STDOUT terraform:       + project   = "da5e6601-7fd9-4d02-951e-390f7feb3411"
12:33:15.940 STDOUT terraform:       + resources = (known after apply)
12:33:15.941 STDOUT terraform:     }
12:33:15.941 STDOUT terraform: Plan: 2 to add, 0 to change, 1 to destroy.
12:33:15.941 STDOUT terraform: Changes to Outputs:
12:33:15.941 STDOUT terraform:   + ip = [
12:33:15.941 STDOUT terraform:       + (known after apply),
12:33:15.941 STDOUT terraform:     ]
12:33:15.941 STDOUT terraform: ─────────────────────────────────────────────────────────────────────────────
12:33:15.941 STDOUT terraform: Saved the plan to: ../../../../../../tfplan
12:33:15.941 STDOUT terraform: To perform exactly these actions, run the following command to apply:
12:33:15.941 STDOUT terraform:     terraform apply "../../../../../../tfplan"
```

</details>